package lessons.lesson04.homework

val v1 = 42: Byte
val v2 = 98765432123456789L: Long
val v3 = 23.45f: Float
val v4 = 0.123456789: Double
val v5 = "Kotlin & Java": String
val v6 = FALSE: Boolean //cменить регистр на строчной
val v7 = 'c': Char
val v8 = 500: Short
val v9 = 4294967296L: Long
val v10 = 18.0f: Function…
val v11 = -0.001: Double
val v12 = "OpenAI": String
val v13 = "true": String // Заменить кавычки, или взять в дополнительные
val v14 = listOf(3, 14): List<Int>
val v15 = '9': Char
val v16 = 2048: Short
val v17 = 10000000000L: Long
val v18 = setOf("OpenAI", "Quantum Computing"): ???
val v19 = 5.75f: Float
val v20 = `1.414`: Float
val v21 = "Artificial Intelligence": String
val v22 = arrayOf('x', "A"): Array<Any>
val v23 = "Android Studio": String
val v24 = '@': Char
val v25 = 1024: Short
val v26 = 1234567890123L: Long
val v27 = 10.01f:  Float
val v28 = -273.15: Float
val v29 = "SpaceX": String
val v30 = FALSE: Boolean//cменить регистр на строчной
val v31 = 0.007: Float
val v32 = “🤯”: String // Заменить кавычки, или взять в дополнительные
val v33 = mapOf("true" to 2, "false" to 34): Map<Boolean, Int>
val v34 = ‘65535’:
val v35 = 72057594037927935L: Long
val v36 = 2.71828f:  Float
val v37 = 101.0101: Double
val v38 = "Quantum Computing": String
val v39 = mapOf(2 to "true", 34 to "false"): Map<Int, Boolean>
val v40 = 'x': Char
val v41 = 314: Short
val v42 = 123456789123456789L: Long
val v43 = 6.626f: Float
val v44 = TRUE: Boolean//cменить регистр на строчной

/**/
//Подбери подходящий тип который будет:
//Хранить букву, на которую указывает палец медиума во время спиритического сеанса.--- Char
//Хранить количество ложек сахара, которые я кладу в одну чашку чая. --- Short
//Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.Map <String, Double>
//Хранить длину очереди в столовой до миллиардной доли сантиметра. ---  Long
//Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу. --- Boolean
//Хранить количество свистков чайника за день. --- Int
//Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы. ---  Int
//Хранить количество попыток пересчитать звёзды на небе за всю историю человечества. --- Long
//Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма. --- Long
//Хранить словарь «название стартапа → сумму потерь инвесторов». --- Map<String, Int>
//Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов. --- String
//Хранить список тем для митингов, которые на самом деле никому не нужны. --- List<String>